{
  "_name_or_path": "../models/bne-large",
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "bos_token_id": 0,
  "eos_token_id": 2,
  "finetuning_task": "ner",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 1024,
  "id2label": {
    "0": "B-OTH",
    "1": "I-OTH",
    "2": "E-OTH",
    "3": "S-ORG",
    "4": "S-OTH",
    "5": "B-PER",
    "6": "E-PER",
    "7": "B-ORG",
    "8": "E-ORG",
    "9": "S-LOC",
    "10": "S-PER",
    "11": "B-LOC",
    "12": "E-LOC",
    "13": "I-PER",
    "14": "I-ORG",
    "15": "I-LOC",
    "16": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "B-OTH": 0,
    "I-OTH": 1,
    "E-OTH": 2,
    "S-ORG": 3,
    "S-OTH": 4,
    "B-PER": 5,
    "E-PER": 6,
    "B-ORG": 7,
    "E-ORG": 8,
    "S-LOC": 9,
    "S-PER": 10,
    "B-LOC": 11,
    "E-LOC": 12,
    "I-PER": 13,
    "I-ORG": 14,
    "I-LOC": 15,
    "O": 16
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "transformers_version": "4.6.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50262
}
