{
  "_name_or_path": "../models/bne-large",
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "bos_token_id": 0,
  "eos_token_id": 2,
  "finetuning_task": "ner",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 1024,
  "id2label": {
    "0": "B_OTH",
    "1": "I_OTH",
    "2": "E_OTH",
    "3": "S_ORG",
    "4": "S_OTH",
    "5": "B_PER",
    "6": "E_PER",
    "7": "B_ORG",
    "8": "E_ORG",
    "9": "S_LOC",
    "10": "S_PER",
    "11": "B_LOC",
    "12": "E_LOC",
    "13": "I_PER",
    "14": "I_ORG",
    "15": "I_LOC",
    "16": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "B_OTH": 0,
    "I_OTH": 1,
    "E_OTH": 2,
    "S_ORG": 3,
    "S_OTH": 4,
    "B_PER": 5,
    "E_PER": 6,
    "B_ORG": 7,
    "E_ORG": 8,
    "S_LOC": 9,
    "S_PER": 10,
    "B_LOC": 11,
    "E_LOC": 12,
    "I_PER": 13,
    "I_ORG": 14,
    "I_LOC": 15,
    "O": 16
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "transformers_version": "4.6.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50262
}
